---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Schema.ListFields
source: html/c1f24aca-c2a6-4a16-0440-2bd8296aa04e.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.ListFields Method

The complete list of fields in the Schema, sorted by name.

## Syntax (C#)
```csharp
public IList<Field> ListFields()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Reading of Entities of this Schema is not allowed to the current add-in.